# код морзе
morse_code = {
    "A": ".-", "J": ".---", "S": "...", "1": ".----",
    "B": "-...", "K": "-.-", "T": "-", "2": "..---",
    "C": "-.-.", "L": ".-..", "U": "..-", "3": "...--",
    "D": "-..", "M": "--", "V": "...-", "4": "....-",
    "E": ".", "N": "-.", "W": ".--", "5": ".....",
    "F": "..-.", "O": "---", "X": "-..-", "6": "-....",
    "G": "--.", "P": ".--.", "Y": "-.--", "7": "--...",
    "H": "....", "Q": "--.-", "Z": "--..", "8": "---..",
    "I": "..", "R": ".-.", "0": "-----", "9": "----."
}


def morse(text):
    encoded_message = ""
    for i in text.upper():
        if i in morse_code:
            encoded_message += morse_code[i] + " "
    return encoded_message


text = input("Введите текст: ").lower()
print("Сообщение в коде Морзе: ", morse(text))
